# OverrideGraphicSettings Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings Class
Members See Also
---
Settings to override display of elements in a view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class OverrideGraphicSettings : IDisposable
```

Visual Basic
---
```text
Public Class OverrideGraphicSettings _
	Implements IDisposable
```

Visual C++
---
```text
public ref class OverrideGraphicSettings : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..OverrideGraphicSettings
# See Also
OverrideGraphicSettings Members
Autodesk.Revit.DB Namespace